
import javax.swing.JOptionPane;

//-----------------------------------------------------------------------------------
/**
@class Pop.java
@brief 팝업창을 위한  클래스

*///----------------------------------------------------------------------------------

public class Pop {
	//-----------------------------------------------------------------------------------
		/**
		@brief Pop클래스의 함수 - 팝업메세지를 받아서 팝업창으로 띄워준다
		@param a string으로 팝업메세지에 쓸 말들을 받아온다
		*///----------------------------------------------------------------------------------

	void Message(String A){
		JOptionPane.showMessageDialog(null,A);
	}
}
